homework/app/controllers/theaters_controller.rb

def create
	t = Theater.new
	t.name = params[:name]
	t.address = params[:address]
	t.phone_number = params[:phone_number]
	t.save
---
INSERT INTO "theaters" ("address", "name", "phone_number") VALUES (?, ?, ?)  [["address", "Chicago"], ["name", "AMC"], ["phone_number", "5555"]]

def show
	@theater = Theater.find_by_id(params[:id])
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1

def edit
	@theater = Theater.find_by_id(params[:id])
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1

def update
	@theater = Theater.find_by_id(params[:id])
	@theater.name = params[:name]
	@theater.address = params[:address]
	@theater.phone_number = params[:phone_number]
	@theater.save
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 2 LIMIT 1
UPDATE "theaters" SET "address" = '4444 Maplegrove Plaza' WHERE "theaters"."id" = 4

def destroy
	t = Theater.find_by_id(params[:id])
	t.destroy
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1
DELETE FROM "theaters" WHERE "theaters"."id" = ?  [["id", 1]]